
## Plan Result (terraform/cloudflare/b0xp.io/openclaw)

[CI link](https://github.com/boxp/arch/actions/runs/22223697312)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_access_application.board
  * cloudflare_access_policy.board_policy
  * cloudflare_record.board
* Update
  * cloudflare_tunnel_config.openclaw_tunnel


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_access_application.board will be created
  + resource "cloudflare_access_application" "board" {
      + account_id                   = (known after apply)
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + domain                       = "board.b0xp.io"
      + domain_type                  = (known after apply)
      + enable_binding_cookie        = false
      + id                           = (known after apply)
      + name                         = "Access application for board.b0xp.io"
      + options_preflight_bypass     = false
      + service_auth_401_redirect    = false
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + skip_interstitial            = false
      + type                         = "self_hosted"
      + zone_id                      = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.board_policy will be created
  + resource "cloudflare_access_policy" "board_policy" {
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for board.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + login_method = [
              + "b9248b7d-c1fa-48ab-8a43-ebffe03fabac",
            ]
        }
    }

  # cloudflare_record.board will be created
  + resource "cloudflare_record" "board" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "board"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "b0fb2694-30f0-4b5e-a239-f1f569933225.cfargotunnel.com"
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel_config.openclaw_tunnel will be updated in-place
  ~ resource "cloudflare_tunnel_config" "openclaw_tunnel" {
        id         = "b0fb2694-30f0-4b5e-a239-f1f569933225"
        # (2 unchanged attributes hidden)

      ~ config {
          ~ ingress_rule {
              + hostname = (known after apply)
              ~ service  = "http_status:404" -> "http://openclaw.openclaw.svc.cluster.local:8080"
                # (1 unchanged attribute hidden)
            }
          + ingress_rule {
              + service = "http_status:404"
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_access_application.openclaw,
  on access.tf line 2, in resource "cloudflare_access_application" "openclaw":
   2: resource "cloudflare_access_application" "openclaw" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 6 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.openclaw,
  on dns.tf line 5, in resource "cloudflare_record" "openclaw":
   5:   value   = cloudflare_tunnel.openclaw_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated Resource

  with cloudflare_access_application.openclaw,
  on access.tf line 2, in resource "cloudflare_access_application" "openclaw":
   2: resource "cloudflare_access_application" "openclaw" {

`cloudflare_access_application` is now deprecated and will be removed in the
next major version. Use `cloudflare_zero_trust_access_application` instead.

(and 6 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.openclaw,
  on dns.tf line 5, in resource "cloudflare_record" "openclaw":
   5:   value   = cloudflare_tunnel.openclaw_tunnel.cname

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and one more similar warning elsewhere)
```



## :warning: Errors

* failed to add a label terraform/cloudflare/b0xp.io/openclaw/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":7113,"Program":"tfcmt","SHA1":"8ff4b97808a09c9fe6a47b5414e61ab3643a48f6","Target":"terraform/cloudflare/b0xp.io/openclaw","Vars":{},"WorkflowName":"pull_request_target"} -->